Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_ecs_cluster.memo-ecs-cluster has changed
~ resource "aws_ecs_cluster" "memo-ecs-cluster" {
      ~ capacity_providers = [
          + "FARGATE",
        ]
        id                 = "arn:aws:ecs:ap-northeast-2:264842458097:cluster/memo-ecs-cluster"
        name               = "memo-ecs-cluster"
        tags               = {
            "Name" = "memo-ecs-cluster"
        }
        # (2 unchanged attributes hidden)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 100
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_ecs_service.memo-ecs-service will be updated in-place
~ resource "aws_ecs_service" "memo-ecs-service" {
        id                                 = "arn:aws:ecs:ap-northeast-2:264842458097:service/memo-ecs-cluster/memo-ecs-service"
        name                               = "memo-ecs-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:264842458097:task-definition/memo-ecs-task-definition:4" -> (known after apply)
        # (13 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.memo-ecs-task-definition will be created
+ resource "aws_ecs_task_definition" "memo-ecs-task-definition" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu          = 256
                  + essential    = true
                  + image        = "264842458097.dkr.ecr.ap-northeast-2.amazonaws.com/memo-ecr:latest"
                  + memory       = 512
                  + name         = "memo-ecs-container"
                  + portMappings = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 80
                        },
                    ]
                },
            ]
        )
      + family                   = "memo-ecs-task-definition"
      + id                       = (known after apply)
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
